[
    {
        "version": "1.4.40",
        "date": "2025-11-07",
        "changes": [
            "feat: Implemented core \"Fire Mage\" special move mechanics, including energy costs, duration, cooldown, and fireball casting.",
            "Added visual effects for active \"Fire Mage\" mode and fireballs.",
            "Temporarily assigned 'K' key and double-tap gesture to activate \"Fire Mage\" mode and cast fireballs.",
            "Fixed multiple regressions related to action function state access and fireball rendering."
        ]
    },
    {
        "version": "1.4.39",
        "date": "2025-11-06",
        "changes": [
            "feat: Implemented player progression system with unlockable personas.",
            "Gameplay: Added `playerStats` to track `flawlessRuns` per difficulty and `obstaclesIncinerated`.",
            "Persistence: Player stats are now saved and loaded from `localStorage`.",
            "Balance: Obstacle incinerations (Fire Spinner, Firestorm, Ground Pound) now correctly increment `obstaclesIncinerated` stat.",
            "Gameplay: Game over logic updated to record flawless runs and persist player stats.",
            "Balance: Decoupled power-up (accelerator) spawning from obstacle spawning for independent generation.",
            "Balance: Power-up frequency is now skill-level dependent (Rookie: most frequent, Pro: least frequent).",
            "Balance: Reduced overall obstacle frequency by 25% across all skill levels for improved gameplay balance.",
            "Balance: Obstacle collision energy depletion changed from 100% to 50% of current energy.",
            "Feature: Created `js/unlocks.js` to define unlock conditions for personas."
        ]
    },
    {
        "version": "1.4.38",
        "date": "2025-11-06",
        "changes": [
            "feat: Implemented a new energy system for special moves.",
            "Gameplay: Special moves now consume energy from a shared pool instead of having individual cooldowns.",
            "Gameplay: Player energy drains over time, and is replenished by collecting accelerators.",
            "Balance: Energy regeneration rates are now tied to skill level, with 'Rookie' players regenerating energy faster than 'Pro' players.",
            "Gameplay: 'Firestorm' and 'Fire Spinner' moves now continuously drain the player's energy to zero over their animation duration.",
            "Balance: 'Firestorm' and 'Fire Spinner' moves now require more than 50% energy to activate.",
            "Balance: Disabled energy regeneration from accelerators while 'Firestorm' or 'Fire Spinner' moves are active.",
            "Balance: Reduced energy gained from accelerator collisions by 50%.",
            "Balance: Decelerator collisions now reduce energy by 10%.",
            "Balance: Obstacle collisions now reset energy to 0.",
            "Balance: Accelerator milestone collisions now increase energy by 10%.",
            "UI: Added an energy bar to the UI to display the player's current energy level."
        ]
    },
    {
        "version": "1.4.37",
        "date": "2025-11-06",
        "changes": [
            "feat: Implemented a new energy system for special moves.",
            "Gameplay: Special moves now consume energy from a shared pool instead of having individual cooldowns.",
            "Gameplay: Player energy drains over time, and is replenished by collecting accelerators.",
            "Balance: Energy regeneration rates are now tied to skill level, with 'Rookie' players regenerating energy faster than 'Pro' players.",
            "Gameplay: 'Firestorm' and 'Fire Spinner' moves now continuously drain the player's energy to zero over their animation duration.",
            "UI: Added an energy bar to the UI to display the player's current energy level."
        ]
    },
    {
        "version": "1.4.36",
        "date": "2025-11-05",
        "changes": [
            "feat: Modularize drawing logic and enhance special moves",
            "Refactor: Split the monolithic `drawing.js` into smaller, specialized modules (`effects.js`, `overlays.js`, `player.js`, `world.js`) to improve maintainability.",
            "Feature: Added sound effects to the \"Firestorm,\" \"Cartoon Scramble,\" \"Houdini,\" and \"Ground Pound\" special moves.",
            "Fix: Resolved multiple state persistence bugs where cooldowns and animations would not reset when starting a new game.",
            "Fix: Corrected a canvas aspect-ratio bug that caused stretching and incorrect padding in fullscreen mode on desktop.",
            "Tweak: Increased the \"hangtime\" for the \"Cartoon Scramble\" jump."
        ]
    },
    {
        "version": "1.4.35",
        "date": "2025-11-05",
        "changes": [
            "Feature: Added Firestorm V2 destruction animation.",
            "Refactor: Renamed original 'Firestorm' to 'Fire Spinner'."
        ]
    },
    {
        "version": "1.4.34",
        "date": "2025-11-05",
        "changes": [
            "Feature: Implemented a new 'Firestorm' custom move, activated by the 'R' key.",
            "Gameplay: When activated, Firestorm creates orbiting fireballs around the character for 10 seconds.",
            "Collision: Obstacles colliding with the player during Firestorm are incinerated into ash, playing the 'fireball.mp3' sound effect.",
            "Cooldown: The Firestorm ability has a 30-second cooldown after use.",
            "Bugfix: Resolved an issue where Firestorm's cooldown was not resetting due to mismatched time sources ('Date.now()' vs 'performance.now()').",
            "Bugfix: Fixed a 'TypeError' where 'state.currentObstacle' was null after incineration, causing the game to crash."
        ]
    },
    {
        "version": "1.4.33",
        "date": "2025-11-05",
        "changes": [
            "Feature: Reassigned 'Backflip' to 'B' key and 'Cartoon Scramble' to 'Z' key.",
            "Enhancement: 'Phase Dash' now leaves a dynamic motion trail.",
            "Enhancement: 'Shockwave' now creates an expanding burst of particle rings.",
            "Enhancement: 'Houdini' move now features realistic smoke particle effects for both disappearance and reappearance.",
            "Enhancement: 'Ground Pound' now generates dynamic debris particles on impact, with colors adapting to the active theme's ground.",
            "Bugfix: Resolved an issue where 'Ground Pound' particle effects failed to re-trigger on subsequent uses.",
            "Improvement: 'Accelerator' power-up now includes a visual fade-out effect on the player's legs, indicating its remaining duration."
        ]
    },
    {
        "version": "1.4.32",
        "date": "2025-11-05",
        "changes": [
            "Feature: Enhanced hurdle animations for a more dynamic visual experience.",
            "Improvement: Hurdles now smoothly scale and fade in as they approach, starting from a smaller, semi-transparent state.",
            "Improvement: After being cleared, hurdles now gradually shrink and fade into the distance, creating a natural horizon effect.",
            "Bugfix: Corrected abrupt animation transitions, ensuring hurdles don't \"pop\" in or out of view."
        ]
    },
    {
        "version": "1.4.31",
        "date": "2025-11-05",
        "changes": [
            "Bugfix: Fixed a persistent issue where the selected persona was not correctly displayed on page load. The initialization sequence was corrected to ensure UI elements are populated before saved settings are applied."
        ]
    }
]