[
    {
        "version": "1.5.09",
        "date": "2025-11-11",
        "changes": [
            "feat(ui): The cash bag animation now appears to go behind the 'Total Haul' box, creating a sense of depth.",
            "feat(ui): The 'Total Haul' value now animates with a 'rolling' number effect when a milestone is passed.",
            "feat(ui): The 'Total Haul' value is now updated when the cash bag animation completes, creating a more satisfying visual effect.",
            "fix(gameplay): Corrected a critical regression where the in-game 'Total Haul' was not updating to reflect the value of the most recently passed milestone.",
            "fix(ui): Re-implemented the missing cash bag animation, ensuring it plays when a milestone is passed.",
            "fix(armory): Fixed a `SyntaxError` caused by a missing state management function (`setTotalAccumulatedCash`) that prevented the armory from loading.",
            "refactor(state): Consolidated state management functions to prevent future naming collisions."
        ]
    },
    {
        "version": "1.5.08",
        "date": "2025-11-12",
        "changes": [
            "fix(style): Refactored the daily challenge animation CSS to use CSS Grid, fixing a bug that caused the UI to be invisible.",
            "fix(style): Removed duplicate CSS rules for daily challenge animations to prevent conflicts and ensure correct styling.",
            "fix(ui): Replaced the <p> tag for the daily challenge placeholder with a <div> to ensure correct HTML structure and rendering.",
            "fix(ui): Corrected the rendering logic for the daily challenge UI to ensure it is always displayed.",
            "fix(debug): Fixed a SyntaxError in debug.js by updating it to use the new displayDailyChallenge function.",
            "fix(build): Added a cache-busting query parameter to the main script import to prevent stale code from being loaded by the browser.",
            "fix(daily-challenge): Resolved a SyntaxError caused by a missing export for the showCountdown function."
        ]
    },
    {
        "version": "1.5.07",
        "date": "2025-11-11",
        "changes": [
            "feat(ui): Displayed `totalAccumulatedCash` at the top of the Armory panel for better visibility of funds available for skill upgrades.",
            "feat(ui): Added a new `div` with ID `totalCashDisplay` in `index.html` to house the cash value.",
            "refactor(armory): Updated `js/ui-modules/armory.js` and `js/dom-elements.js` to correctly populate and export the `totalCashDisplay` element."
        ]
    },
    {
        "version": "1.5.06",
        "date": "2025-11-11",
        "changes": [
            "feat(ui): The in-game info panel now dynamically displays gamepad controls when a controller is connected, and reverts to keyboard/mobile controls when disconnected.",
            "feat(gamepad): The info icon is now a focusable element, allowing gamepad users to open and close the info panel.",
            "feat(gamepad): Remapped the gamepad controls to feature more impressive skills: `X` button triggers Meteor Strike, `Y` button triggers Firestorm, Left Trigger triggers Houdini, and Right Trigger triggers Fiery Ground Pound.",
            "docs(ui): Updated the in-game info panel to reflect the new, dynamic gamepad control scheme and updated button assignments."
        ]
    },
    {
        "version": "1.5.05",
        "date": "2025-11-11",
        "changes": [
            "docs: Updated the in-game info panel to include all keyboard and mobile gesture commands."
        ]
    },
    {
        "version": "1.5.04",
        "date": "2025-11-11",
        "changes": [
            "feat(gameplay): Implemented a feature to automatically pause the game and its audio when the browser tab loses focus or is minimized.",
            "feat(privacy): Enhanced user privacy by preventing the game from running in the background, which could potentially capture audio or screen information without the user's knowledge.",
            "fix(ux): Improved the user experience by preventing the game from continuing to play audio when the user has switched to another tab or locked their screen."
        ]
    },
    {
        "version": "1.5.02",
        "date": "2025-11-09",
        "changes": [
            "feat(gameplay): Added full gamepad support for gameplay and UI navigation.",
            "feat(gameplay): Created a new `gamepad.js` module to handle all controller input, running in a separate loop to ensure responsiveness.",
            "feat(ui): Implemented UI navigation via D-pad, allowing selection of buttons and dropdowns.",
            "feat(ui): Added a UI indicator to show when a gamepad is connected.",
            "feat(gameplay): Mapped all core player moves to an intuitive controller layout, including bumpers and triggers.",
            "feat(gameplay): Added a gamepad cheat code (Left + Right Bumper) to grant maximum energy.",
            "feat(gameplay): Unified the 'Back' button and 'Escape' key behavior to intelligently exit fullscreen or reset the game.",
            "fix(gamepad): Resolved multiple cross-browser compatibility issues, ensuring D-pad navigation works in both Chrome and Edge.",
            "fix(gamepad): Fixed numerous state management bugs that caused the controller to become unresponsive after pausing, resetting, or changing button mappings."
        ]
    },
    {
        "version": "1.5.01",
        "date": "2025-11-08",
        "changes": [
            "feat: Added new special skill: 'Mage-Spinner'. This skill combines the effects of the Fire-Spinner and Fire-Mage, automatically casting fireballs at nearby obstacles.",
            "feat: Added visual effects for the Mage Spinner, including a fiery glow, embers, and orbiting fireballs.",
            "feat: Added the ability to manually cast fireballs by pressing the skill key ('U') while Mage Spinner is active.",
            "docs: Added the Mage-Spinner keybinding to the keyboard controls in the info panel.",
            "fix: Fixed a critical syntax error in `js/main.js` by correcting the placement of several code blocks.",
            "fix: Fixed multiple `ReferenceError`s across several files by importing necessary constants.",
            "fix: Fixed a bug preventing manual fireballs from being cast during Mage Spinner.",
            "perf: Lowered the energy cost of the Mage Spinner from 100 to 80."
        ]
    },
    {
        "version": "1.4.52",
        "date": "2025-11-08",
        "changes": [
            "Feature: Enhanced the debug panel's "Unlock all" functionality. The button now unlocks all Armory skills in addition to all Personas, providing a more comprehensive testing tool."
        ]
    }
]