[
    {
        "version": "1.4.35",
        "date": "2025-11-05",
        "changes": [
            "Feature: Added Firestorm V2 destruction animation.",
            "Refactor: Renamed original 'Firestorm' to 'Fire Spinner'."
        ]
    },
    {
        "version": "1.4.34",
        "date": "2025-11-05",
        "changes": [
            "Feature: Implemented a new 'Firestorm' custom move, activated by the 'R' key.",
            "Gameplay: When activated, Firestorm creates orbiting fireballs around the character for 10 seconds.",
            "Collision: Obstacles colliding with the player during Firestorm are incinerated into ash, playing the 'fireball.mp3' sound effect.",
            "Cooldown: The Firestorm ability has a 30-second cooldown after use.",
            "Bugfix: Resolved an issue where Firestorm's cooldown was not resetting due to mismatched time sources ('Date.now()' vs 'performance.now()').",
            "Bugfix: Fixed a 'TypeError' where 'state.currentObstacle' was null after incineration, causing the game to crash."
        ]
    },
    {
        "version": "1.4.33",
        "date": "2025-11-05",
        "changes": [
            "Feature: Reassigned 'Backflip' to 'B' key and 'Cartoon Scramble' to 'Z' key.",
            "Enhancement: 'Phase Dash' now leaves a dynamic motion trail.",
            "Enhancement: 'Shockwave' now creates an expanding burst of particle rings.",
            "Enhancement: 'Houdini' move now features realistic smoke particle effects for both disappearance and reappearance.",
            "Enhancement: 'Ground Pound' now generates dynamic debris particles on impact, with colors adapting to the active theme's ground.",
            "Bugfix: Resolved an issue where 'Ground Pound' particle effects failed to re-trigger on subsequent uses.",
            "Improvement: 'Accelerator' power-up now includes a visual fade-out effect on the player's legs, indicating its remaining duration."
        ]
    },
    {
        "version": "1.4.32",
        "date": "2025-11-05",
        "changes": [
            "Feature: Enhanced hurdle animations for a more dynamic visual experience.",
            "Improvement: Hurdles now smoothly scale and fade in as they approach, starting from a smaller, semi-transparent state.",
            "Improvement: After being cleared, hurdles now gradually shrink and fade into the distance, creating a natural horizon effect.",
            "Bugfix: Corrected abrupt animation transitions, ensuring hurdles don't \"pop\" in or out of view."
        ]
    },
    {
        "version": "1.4.31",
        "date": "2025-11-05",
        "changes": [
            "Bugfix: Fixed a persistent issue where the selected persona was not correctly displayed on page load. The initialization sequence was corrected to ensure UI elements are populated before saved settings are applied."
        ]
    },
    {
        "version": "1.4.30",
        "date": "2025-11-05",
        "changes": [
            "Bugfix: Fixed an issue where the `personaSelector`'s selected item was not being saved to localStorage, even though the persona details were correctly displayed. The `personaSelector` now correctly reflects the last saved persona on load."
        ]
    },
    {
        "version": "1.4.29",
        "date": "2025-11-05",
        "changes": [
            "Bugfix: Fixed a regression where persona-specific background music was not playing. The game now correctly prioritizes persona music over custom emoji music when a persona is selected."
        ]
    },
    {
        "version": "1.4.28",
        "date": "2025-11-05",
        "changes": [
            "Bugfix: Fixed a regression where background music was not playing for any persona or custom emoji. The music player now correctly handles both persona-specific and emoji-based music URLs.",
            "Bugfix: Corrected a typo in the music file path for the 'lion' emoji."
        ]
    },
    {
        "version": "1.4.27",
        "date": "2025-11-05",
        "changes": [
            "Bugfix: Fixed an issue where the background music for some personas was not loading correctly. The music player now correctly loads the music specified in the persona's `music` property."
        ]
    },
    {
        "version": "1.4.26",
        "date": "2025-11-05",
        "changes": [
            "Feature: Added a persona details display. When a predefined persona is selected, their emoji, financial trait, discipline level, and skill level are displayed to the user."
        ]
    }
]