[
    {
        "version": "1.5.22",
        "date": "2025-11-18",
        "changes": [
            "fix(skill): Corrected the Six Shooter Pistol's bullet trajectory to align with the ground's angle. Inverted Y-axis movement and drawing rotation to prevent bullets from firing in the wrong direction on angled planes.",
            "feat(skill): Adjusted the Six Shooter Pistol's bullet spawn position by an additional 5 pixels upwards for better visual alignment with the player."
        ]
    },
    {
        "version": "1.5.21",
        "date": "2025-11-18",
        "changes": [
            "feat(skill): Implemented Phase 1 & 2 of the 'Six Shooter Pistol' skill. This includes its definition in the armory, unlock conditions, state management for ammo/reloading, and integration into the game's core action system to make it functional."
        ]
    },
    {
        "version": "1.5.20",
        "date": "2025-11-18",
        "changes": [
            "feat(skill): Implemented Phase 1 of the 'Six Shooter Pistol' skill, including its definition in the armory UI, initialization of Fire Mage incineration tracking, and logic to increment Fire Mage incinerations for unlock progression."
        ]
    },
    {
        "version": "1.5.18",
        "date": "2025-11-16",
        "changes": [
            "feat(easter-egg): Implemented an easter egg obstacle (\"🥚\") that has a small chance to spawn instead of a regular obstacle. Colliding with the easter egg triggers a special console log message and prevents normal collision penalties, serving as a placeholder for future mini-game integration."
        ]
    },
    {
        "version": "1.5.17",
        "date": "2025-11-16",
        "changes": [
            "fix(shotgun): Resolved a critical bug where the shotgun blast particle animation was not rendering. The fix involved centralizing the skill's `draw` logic, ensuring its `update` function is called in the main game loop, and correcting state management function signatures."
        ]
    },
    {
        "version": "1.5.16",
        "date": "2025-11-16",
        "changes": [
            "fix(gamepad): Resolved a series of complex bugs related to the gamepad's interaction with the new audio preloader and fullscreen mode. This includes fixing unresponsive in-game controls, ensuring the pause/unpause and reset functions work reliably in all states (including fullscreen), and preventing the gamepad from losing focus after re-entering fullscreen mode.",
            "feat(audio): Added a sound effect to the 'Start Game' button on the preloader.",
            "feat(audio): Added a 'beep' sound effect to the 'Load Custom Data' button and the skill upgrade modal's close button.",
            "feat(ui): Implemented a favicon for the game."
        ]
    },
    {
        "version": "1.5.15",
        "date": "2025-11-16",
        "changes": [
            "feat(cheat): Added an emoji-based cheat mode. Clicking the second fire emoji in the main title copies it to the clipboard. Pasting this emoji into the player emoji input field unlocks all personas, skills, and grants 1,000,000,000 cash for upgrades."
        ]
    },
    {
        "version": "1.5.14",
        "date": "2025-11-16",
        "changes": [
            "fix(collision): Corrected the shotgun blast collision detection logic to accurately register hits on obstacles.",
            "refactor(collision): Replaced the flawed angle-based collision check with a more reliable Axis-Aligned Bounding Box (AABB) implementation."
        ]
    },
    {
        "version": "1.5.12",
        "date": "2025-11-12",
        "changes": [
            "feat(gameplay): Implemented four new special moves: \"Blink Strike,\" \"Jetstream Dash,\" \"Echo Slam,\" and \"Fireball Roll.\"",
            "feat(gameplay): Enhanced Echo Slam's secondary shockwave to be destructive, clearing a second nearby obstacle.",
            "feat(visuals): Created a new, high-speed particle effect for Jetstream Dash, replacing the generic hover particles.",
            "feat(visuals): Added a brief screen flash upon Blink Strike's reappearance for increased visual impact.",
            "feat(visuals): Added flaking ember particles to the Fireball Roll animation for a more dynamic and fiery appearance.",
            "feat(gameplay): Modified Fireball Roll to prevent automatic jumping, allowing the player to roll along the ground unless a jump is manually triggered.",
            "feat(gameplay): Implemented precise collision detection for the Fireball Roll, requiring a direct overlap with obstacles for incineration, and fixed a bug where invincibility was preventing collision.",
            "feat(visuals): Implemented a new \"ash blow\" particle effect for Fireball Roll incineration, triggered when the fireball is centered on the obstacle.",
            "feat(ui): Replaced the emoji for Fiery Houdini with custom locked and unlocked image paths.",
            "perf(visuals): Slowed down the spinning animation of the Fireball Roll for improved visual appeal (applied twice).",
            "fix(code): Corrected a `ReferenceError` in `actions.js` by importing the `setScreenFlash` function.",
            "fix(code): Corrected a `SyntaxError` in `actions.js` by adding a missing closing brace."
        ]
    }
]