[
    {
        "version": "1.5.05",
        "date": "2025-11-11",
        "changes": [
            "docs: Updated the in-game info panel to include all keyboard and mobile gesture commands."
        ]
    },
    {
        "version": "1.5.04",
        "date": "2025-11-11",
        "changes": [
            "feat(gameplay): Implemented a feature to automatically pause the game and its audio when the browser tab loses focus or is minimized.",
            "feat(privacy): Enhanced user privacy by preventing the game from running in the background, which could potentially capture audio or screen information without the user's knowledge.",
            "fix(ux): Improved the user experience by preventing the game from continuing to play audio when the user has switched to another tab or locked their screen."
        ]
    },
    {
        "version": "1.5.02",
        "date": "2025-11-09",
        "changes": [
            "feat(gameplay): Added full gamepad support for gameplay and UI navigation.",
            "feat(gameplay): Created a new `gamepad.js` module to handle all controller input, running in a separate loop to ensure responsiveness.",
            "feat(ui): Implemented UI navigation via D-pad, allowing selection of buttons and dropdowns.",
            "feat(ui): Added a UI indicator to show when a gamepad is connected.",
            "feat(gameplay): Mapped all core player moves to an intuitive controller layout, including bumpers and triggers.",
            "feat(gameplay): Added a gamepad cheat code (Left + Right Bumper) to grant maximum energy.",
            "feat(gameplay): Unified the 'Back' button and 'Escape' key behavior to intelligently exit fullscreen or reset the game.",
            "fix(gamepad): Resolved multiple cross-browser compatibility issues, ensuring D-pad navigation works in both Chrome and Edge.",
            "fix(gamepad): Fixed numerous state management bugs that caused the controller to become unresponsive after pausing, resetting, or changing button mappings."
        ]
    },
    {
        "version": "1.5.01",
        "date": "2025-11-08",
        "changes": [
            "feat: Added new special skill: 'Mage-Spinner'. This skill combines the effects of the Fire-Spinner and Fire-Mage, automatically casting fireballs at nearby obstacles.",
            "feat: Added visual effects for the Mage Spinner, including a fiery glow, embers, and orbiting fireballs.",
            "feat: Added the ability to manually cast fireballs by pressing the skill key ('U') while Mage Spinner is active.",
            "docs: Added the Mage-Spinner keybinding to the keyboard controls in the info panel.",
            "fix: Fixed a critical syntax error in `js/main.js` by correcting the placement of several code blocks.",
            "fix: Fixed multiple `ReferenceError`s across several files by importing necessary constants.",
            "fix: Fixed a bug preventing manual fireballs from being cast during Mage Spinner.",
            "perf: Lowered the energy cost of the Mage Spinner from 100 to 80."
        ]
    },
    {
        "version": "1.4.52",
        "date": "2025-11-08",
        "changes": [
            "Feature: Enhanced the debug panel's \"Unlock all\" functionality. The button now unlocks all Armory skills in addition to all Personas, providing a more comprehensive testing tool."
        ]
    },
    {
        "version": "1.4.51",
        "date": "2025-11-07",
        "changes": [
            "feat: Added a placeholder for the 'Fire Dash' skill in the Armory, making it visible but not yet unlockable."
        ]
    },
    {
        "version": "1.4.50",
        "date": "2025-11-07",
        "changes": [
            "feat: Mapped the double-tap gesture to the general 'Special Move' action, allowing it to trigger any selected Armory skill.",
            "refactor: Centralized special move logic into a `handleSpecialMove` function in `js/main.js` to streamline keyboard and gesture controls."
        ]
    },
    {
        "version": "1.4.49",
        "date": "2025-11-07",
        "changes": [
            "feat: Greyed out the emoji and name of locked Personas in the selector to make their unavailability more apparent."
        ]
    },
    {
        "version": "1.4.48",
        "date": "2025-11-07",
        "changes": [
            "feat: Right-justified the lock/unlock icon for Personas in the selector.",
            "feat: The lock/unlock icon is now only displayed for Personas that have unlock conditions."
        ]
    },
    {
        "version": "1.4.47",
        "date": "2025-11-07",
        "changes": [
            "feat: Updated Persona selector labels to use lock (🔒) and unlock (🔓) emojis to clearly indicate the status of each persona."
        ]
    }
]