[
    {
        "version": "1.5.17",
        "date": "2025-11-16",
        "changes": [
            "fix(shotgun): Resolved a critical bug where the shotgun blast particle animation was not rendering. The fix involved centralizing the skill's `draw` logic, ensuring its `update` function is called in the main game loop, and correcting state management function signatures."
        ]
    },
    {
        "version": "1.5.16",
        "date": "2025-11-16",
        "changes": [
            "fix(gamepad): Resolved a series of complex bugs related to the gamepad's interaction with the new audio preloader and fullscreen mode. This includes fixing unresponsive in-game controls, ensuring the pause/unpause and reset functions work reliably in all states (including fullscreen), and preventing the gamepad from losing focus after re-entering fullscreen mode.",
            "feat(audio): Added a sound effect to the 'Start Game' button on the preloader.",
            "feat(audio): Added a 'beep' sound effect to the 'Load Custom Data' button and the skill upgrade modal's close button.",
            "feat(ui): Implemented a favicon for the game."
        ]
    },
    {
        "version": "1.5.15",
        "date": "2025-11-16",
        "changes": [
            "feat(cheat): Added an emoji-based cheat mode. Clicking the second fire emoji in the main title copies it to the clipboard. Pasting this emoji into the player emoji input field unlocks all personas, skills, and grants 1,000,000,000 cash for upgrades."
        ]
    },
    {
        "version": "1.5.14",
        "date": "2025-11-16",
        "changes": [
            "fix(collision): Corrected the shotgun blast collision detection logic to accurately register hits on obstacles.",
            "refactor(collision): Replaced the flawed angle-based collision check with a more reliable Axis-Aligned Bounding Box (AABB) implementation."
        ]
    },
    {
        "version": "1.5.12",
        "date": "2025-11-12",
        "changes": [
            "feat(gameplay): Implemented four new special moves: \"Blink Strike,\" \"Jetstream Dash,\" \"Echo Slam,\" and \"Fireball Roll.\"",
            "feat(gameplay): Enhanced Echo Slam's secondary shockwave to be destructive, clearing a second nearby obstacle.",
            "feat(visuals): Created a new, high-speed particle effect for Jetstream Dash, replacing the generic hover particles.",
            "feat(visuals): Added a brief screen flash upon Blink Strike's reappearance for increased visual impact.",
            "feat(visuals): Added flaking ember particles to the Fireball Roll animation for a more dynamic and fiery appearance.",
            "feat(gameplay): Modified Fireball Roll to prevent automatic jumping, allowing the player to roll along the ground unless a jump is manually triggered.",
            "feat(gameplay): Implemented precise collision detection for the Fireball Roll, requiring a direct overlap with obstacles for incineration, and fixed a bug where invincibility was preventing collision.",
            "feat(visuals): Implemented a new \"ash blow\" particle effect for Fireball Roll incineration, triggered when the fireball is centered on the obstacle.",
            "feat(ui): Replaced the emoji for Fiery Houdini with custom locked and unlocked image paths.",
            "perf(visuals): Slowed down the spinning animation of the Fireball Roll for improved visual appeal (applied twice).",
            "fix(code): Corrected a `ReferenceError` in `actions.js` by importing the `setScreenFlash` function.",
            "fix(code): Corrected a `SyntaxError` in `actions.js` by adding a missing closing brace."
        ]
    },
    {
        "version": "1.5.09",
        "date": "2025-11-11",
        "changes": [
            "feat(ui): The cash bag animation now appears to go behind the 'Total Haul' box, creating a sense of depth.",
            "feat(ui): The 'Total Haul' value now animates with a 'rolling' number effect when a milestone is passed.",
            "feat(ui): The 'Total Haul' value is now updated when the cash bag animation completes, creating a more satisfying visual effect.",
            "fix(gameplay): Corrected a critical regression where the in-game 'Total Haul' was not updating to reflect the value of the most recently passed milestone.",
            "fix(ui): Re-implemented the missing cash bag animation, ensuring it plays when a milestone is passed.",
            "fix(armory): Fixed a `SyntaxError` caused by a missing state management function (`setTotalAccumulatedCash`) that prevented the armory from loading.",
            "refactor(state): Consolidated state management functions to prevent future naming collisions."
        ]
    },
    {
        "version": "1.5.08",
        "date": "2025-11-12",
        "changes": [
            "fix(style): Refactored the daily challenge animation CSS to use CSS Grid, fixing a bug that caused the UI to be invisible.",
            "fix(style): Removed duplicate CSS rules for daily challenge animations to prevent conflicts and ensure correct styling.",
            "fix(ui): Replaced the <p> tag for the daily challenge placeholder with a <div> to ensure correct HTML structure and rendering.",
            "fix(ui): Corrected the rendering logic for the daily challenge UI to ensure it is always displayed.",
            "fix(debug): Fixed a SyntaxError in debug.js by updating it to use the new displayDailyChallenge function.",
            "fix(build): Added a cache-busting query parameter to the main script import to prevent stale code from being loaded by the browser.",
            "fix(daily-challenge): Resolved a SyntaxError caused by a missing export for the showCountdown function."
        ]
    },
    {
        "version": "1.5.07",
        "date": "2025-11-11",
        "changes": [
            "feat(ui): Displayed `totalAccumulatedCash` at the top of the Armory panel for better visibility of funds available for skill upgrades.",
            "feat(ui): Added a new `div` with ID `totalCashDisplay` in `index.html` to house the cash value.",
            "refactor(armory): Updated `js/ui-modules/armory.js` and `js/dom-elements.js` to correctly populate and export the `totalCashDisplay` element."
        ]
    },
    {
        "version": "1.5.06",
        "date": "2025-11-11",
        "changes": [
            "feat(ui): The in-game info panel now dynamically displays gamepad controls when a controller is connected, and reverts to keyboard/mobile controls when disconnected.",
            "feat(gamepad): The info icon is now a focusable element, allowing gamepad users to open and close the info panel.",
            "feat(gamepad): Remapped the gamepad controls to feature more impressive skills: `X` button triggers Meteor Strike, `Y` button triggers Firestorm, Left Trigger triggers Houdini, and Right Trigger triggers Fiery Ground Pound.",
            "docs(ui): Updated the in-game info panel to reflect the new, dynamic gamepad control scheme and updated button assignments."
        ]
    },
    {
        "version": "1.5.05",
        "date": "2025-11-11",
        "changes": [
            "docs: Updated the in-game info panel to include all keyboard and mobile gesture commands."
        ]
    },
    {
        "version": "1.5.04",
        "date": "2025-11-11",
        "changes": [
            "feat(gameplay): Implemented a feature to automatically pause the game and its audio when the browser tab loses focus or is minimized.",
            "feat(privacy): Enhanced user privacy by preventing the game from running in the background, which could potentially capture audio or screen information without the user's knowledge.",
            "fix(ux): Improved the user experience by preventing the game from continuing to play audio when the user has switched to another tab or locked their screen."
        ]
    }
]