[
    {
        "version": "1.4.51",
        "date": "2025-11-07",
        "changes": [
            "feat: Added a placeholder for the 'Fire Dash' skill in the Armory, making it visible but not yet unlockable."
        ]
    },
    {
        "version": "1.4.50",
        "date": "2025-11-07",
        "changes": [
            "feat: Mapped the double-tap gesture to the general 'Special Move' action, allowing it to trigger any selected Armory skill.",
            "refactor: Centralized special move logic into a `handleSpecialMove` function in `js/main.js` to streamline keyboard and gesture controls."
        ]
    },
    {
        "version": "1.4.49",
        "date": "2025-11-07",
        "changes": [
            "feat: Greyed out the emoji and name of locked Personas in the selector to make their unavailability more apparent."
        ]
    },
    {
        "version": "1.4.48",
        "date": "2025-11-07",
        "changes": [
            "feat: Right-justified the lock/unlock icon for Personas in the selector.",
            "feat: The lock/unlock icon is now only displayed for Personas that have unlock conditions."
        ]
    },
    {
        "version": "1.4.47",
        "date": "2025-11-07",
        "changes": [
            "feat: Updated Persona selector labels to use lock (🔒) and unlock (🔓) emojis to clearly indicate the status of each persona."
        ]
    },
    {
        "version": "1.4.46",
        "date": "2025-11-07",
        "changes": [
            "fix: Resolved a wrapping issue with the Heist Control Panel tabs by adding `flex-wrap` to their container, ensuring they wrap correctly on smaller screens."
        ]
    },
    {
        "version": "1.4.45",
        "date": "2025-11-07",
        "changes": [
            "feat: Implemented the \"Destroy 3 obstacles in a row using only the Ground Pound move\" achievement for the Fire Spinner skill.",
            "Added logic to track `consecutiveGroundPounds` in `state.playerStats`, incrementing on successful Ground Pound destruction and resetting on other collisions, missed obstacles, or other destructive moves.",
            "Ensured `consecutiveGroundPounds` is correctly saved, loaded, and reset with the game state.",
            "Added a console notification when an Armory achievement is met."
        ]
    },
    {
        "version": "1.4.44",
        "date": "2025-11-07",
        "changes": [
            "feat: Implemented the ability to select and unselect unlocked special skills from the Armory.",
            "The 'K' key now dynamically triggers the currently selected Armory skill, or reverts to the default Fire Mage action if no skill is selected.",
            "Added UI elements (Select/Unselect buttons) to the Armory tab for managing active skills.",
            "Ensured the selected active skill persists across game sessions via `localStorage`.",
            "Added a sanity check on application load to deselect any `activeArmorySkill` that is no longer unlocked, preventing inconsistent game states.",
            "fix: Fixed a `ReferenceError` in `js/main.js` related to module scope for event handlers.",
            "fix: Restored missing control panel event listeners in `js/main.js` that were inadvertently removed during a previous fix, resolving UI unresponsiveness.",
            "fix: Ensured `activeArmorySkill` is reset to `null` when the game state is reset."
        ]
    },
    {
        "version": "1.4.43",
        "date": "2025-11-07",
        "changes": [
            "feat: Implemented persistence for unlocked Armory items using `localStorage`.",
            "Added `unlockedArmoryItems` to `playerStats` to track unlocked skills.",
            "Updated `checkSkillUnlockStatus` to recognize permanently unlocked items.",
            "Ensured `unlockedArmoryItems` is correctly saved and loaded across sessions.",
            "Added a progress display for locked Armory items, showing current progress towards unlock conditions.",
            "Fixed a critical bug where destructive moves (`Firestorm`, `Ground Pound`, etc.) would not count towards the `obstaclesIncinerated` total if the player's jump was high enough to clear the obstacle.",
            "Fixed a critical bug where `playerStats` were being inadvertently overwritten with default values on page load due to an incorrect `savePlayerStats()` call within `loadSettings()`.",
            "Fixed a bug where debug panel changes to `playerStats` were not persisting across reloads due to `initializeDebugPanel` being called before `initializeUIData`.",
            "Enhanced the UI for unlocked Armory items by adding a subtle orange overlay and a glowing effect to the icon."
        ]
    },
    {
        "version": "1.4.42",
        "date": "2025-11-07",
        "changes": [
            "feat: Added a new \"Armory\" tab to the control panel.",
            "Implemented dynamic display of unlockable skills in the Armory.",
            "\"Firestorm\" is now the first unlockable skill, requiring 100 incinerations.",
            "\"Fire Spinner\" is the second unlockable skill, with its unlock condition to be determined.",
            "Added styling for Armory items, including locked/unlocked states."
        ]
    }
]