[
    {
        "version": "1.2.2",
        "date": "2025-11-02",
        "changes": [
            "Bugfix: Resolved a critical bug where the end-of-game results chart would crash on the first run by adding a defensive check to the chart drawing function."
        ]
    },
    {
        "version": "1.2.1",
        "date": "2025-11-02",
        "changes": [
            "Bugfix: Fixed a regression where the end-of-game results chart would fail to render by ensuring the chart drawing function is called at the correct time and with valid data."
        ]
    },
    {
        "version": "1.2.0",
        "date": "2025-11-02",
        "changes": [
            "Feature: Implemented the 'Flawless Heist' Chronicle high score system, adding a 'Hall of Fame' tab to display best runs for each difficulty."
        ]
    },
    {
        "version": "1.1.9",
        "date": "2025-11-02",
        "changes": [
            "Enhancement: Further improved active tab styling for better visual distinction and user experience."
        ]
    },
    {
        "version": "1.1.8",
        "date": "2025-11-02",
        "changes": [
            "Feature: Implemented localStorage persistence for the mute setting."
        ]
    },
    {
        "version": "1.1.7",
        "date": "2025-11-02",
        "changes": [
            "Enhancement: Improved the tabbed interface with pipe separators and a more distinct active state for better visual clarity."
        ]
    },
    {
        "version": "1.1.6",
        "date": "2025-11-02",
        "changes": [
            "Enhancement: Updated the default dataset in `milestones.json` to a comprehensive 7-year FIRE journey with 20 custom events for robust testing and demonstration."
        ]
    },
    {
        "version": "1.1.5",
        "date": "2025-11-02",
        "changes": [
            "Feature: Added a 'Disable Saved Settings' checkbox to give users control over `localStorage` persistence."
        ]
    },
    {
        "version": "1.1.4",
        "date": "2025-11-02",
        "changes": [
            "Feature: Implemented `localStorage` to persist user settings (emoji, obstacle, frequency, skill, speed) and custom milestone/event data."
        ]
    },
    {
        "version": "1.1.3",
        "date": "2025-11-02",
        "changes": [
            "Feature: Created `milestones.json` to store default milestone and event data.",
            "Enhancement: The application now loads default data from `milestones.json` on startup."
        ]
    },
    {
        "version": "1.1.2",
        "date": "2025-11-02",
        "changes": [
            "Bugfix: Resolved an issue where a custom event's entrance animation would loop if the event was missed by the player."
        ]
    },
    {
        "version": "1.1.1",
        "date": "2025-11-02",
        "changes": [
            "Bugfix: Corrected the music pause functionality to use `Tone.Transport` for pausing and resuming audio."
        ]
    },
    {
        "version": "1.1.0",
        "date": "2025-11-02",
        "changes": [
            "Enhancement: Moved the version display from the footer to the main title."
        ]
    }
]
